[
    {
        "name": "EGR Systems",
        "img": "https://i.ibb.co/t2bG4k2/egr-system.png",
        "description": "Recirculating exhaust gas and combining it with an air and fuel mixture reduces the combustion temperatures that produce harmful nitrogen oxide (NOx) emissions. We develop complete high- or low-pressure EGR systems tailored to its customer's specifications that reduce fuel consumption and emissions.",
        "features": [
            "Fully integrated EGR solution",
            "Tailored system for any application",
            "Robust, highly engineered components",
            "Optimizes combustion process",
            "Reduces fuel consumption and emissions"
        ],
        "minOrder": 12,
        "availableQuantity": 200,
        "price": 350
    },
    {
        "name": "GDi Pumps",
        "img": "https://i.ibb.co/p2RBg0V/gdi-pump.png",
        "description": "Our range of high pressure fuel pumps provide best in class performance at pressures over 500 bar. Our unique plunger ring seal technology significantly improves pump efficiency, allowing our customers to upgrade their engines to 500+ bar pressure without increasing the load on the valvetrain.",
        "features": [
            "Up to 600 bar pressure continuous operation",
            "Includes unique Plunger Ring Seal feature to improve efficiency and reduce stress on the valvetrain",
            "Direct drop in replacement for existing GFP2 pump",
            "Variable plunger diameters available to optimize performance and minimize cam loads; 6mm, 7mm, 8mm, 9mm"
        ],
        "minOrder": 12,
        "availableQuantity": 200,
        "price": 150
    },
    {
        "name": "P2 On-Axis Drive Module",
        "img": "https://i.ibb.co/tzmHx86/img-25-p2-hybrid-module.png",
        "description": "Our P2 module converts a combustion-powered vehicle into a hybrid without changing the engine or transmission. That means automakers can easily expand their vehicle portfolio with less investment and more flexibility. Placed between the engine and transmission, the highly efficient P2 module combines a 48V electric traction motor, engine disconnect clutch, launch device and dual mass flywheel into a compact package nested inside the motor.",
        "features": [
            "Compatible with all transmission architectures, including manual transmissions",
            "Clutch hydraulic control module available",
            "Efficient oil and water-cooled traction motor",
            "May also include integrated dual-mass flywheel and launch device"
        ],
        "minOrder": 12,
        "availableQuantity": 200,
        "price": 350
    },
    {
        "name": "Propulsion Controllers",
        "img": "https://i.ibb.co/cT64sGy/engine-control-unit-mt95-1-3.png",
        "description": "Propulsion controllers sit at the heart of any Hybrid engine management system to electronically direct and co-ordinate operations such as the engine controller, transmission controller, inverter and battery. Our Application Specific Integrated Circuits (ASICs) provide a highly flexible and cost effective solution.",
        "features": [
            "Quad core 300 Mhz CPU with expandable memory capabilities",
            "112 pin connector capable of integrating new functionality"
        ],
        "minOrder": 12,
        "availableQuantity": 200,
        "price": 250
    },
    {
        "name": "Battery Management Controllers",
        "img": "https://i.ibb.co/xjw6RFS/battery-management-system-1.png",
        "description": "Our Battery Management Controllers for Hybrid and Electric vehicles are designed to monitor the critical state-of-charge, state-of-health and battery temperature of individual cells, while precisely measuring current flow in and out of the battery pack.",
        "features": [
            "Operating at battery voltage up to 800V",
            "Simultaneous cell and Bus-Bar voltage Acquisition",
            "Contactor control and diagnostics",
            "Battery pack cell balancing",
            "Flexible configuration: 'All in One' system or distributed"
        ],
        "minOrder": 12,
        "availableQuantity": 200,
        "price": 450
    },
    {
        "name": "High Voltage Coolant Heaters",
        "img": "https://i.ibb.co/VBrLjQV/hv-coolant-heater.png",
        "description": "Batteries have a narrow optimal temperature range. BorgWarner’s specially developed high voltage coolant heaters have been developed to keep the core components of hybrid and pure electric vehicles at temperatures that facilitate maximum charging efficiency, durability and driving range. It delivers heat to the interior quickly and clears the ice from windows in short order.",
        "features": [
            "Compact modular design with high thermal power density",
            "Clean room manufacturing approach - safety and reduced manufacturing cost"
        ],
        "minOrder": 12,
        "availableQuantity": 200,
        "price": 350
    }
]