[
    {
        "name": "S. Borrelli",
        "img": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e956d788-e9dc-43cc-910c-3d5ac54b206a._CR109,0,281,281_SX460_.jpg",
        "review": "They seemed to have the part I needed. I knew nothing about this online vendor so I cautiously ordered the part using PayPal. I waited two weeks and didn't see the part. I thought it might be a scam until I realized I never pressed 'ORDER'. Duh! Once I did, the part came in a few days.",
        "rating": 5
    },
    {
        "name": "Krista Kitty",
        "img": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/09bb329d-f298-4319-a9ca-7c85254ce165._CR0,13,306,306_UX460_.jpg",
        "review": "It was a simple process in which I was able to purchase it through linking to my Google, Facebook account, or create an account. I entered my vehicle information into their site to ensure I got the right part.",
        "rating": 4
    },
    {
        "name": "Garcia",
        "img": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/35f305fb-562f-4347-bece-cb5e561fb620._CR21,0,675,675_SX460_.jpg",
        "review": "I had an issue with some items I ordered and needed to contact the company. Looking for an email address on their website I saw I could use the 'chat' feature to contact them.",
        "rating": 3
    },
    {
        "name": "Joseph Pitt",
        "img": "",
        "review": "They had what I thought I needed, but after checking I didn't need the whole thing. I cancelled 1 of the 2 items on the order 3 hours after placing it.",
        "rating": 4
    },
    {
        "name": "Grossman",
        "img": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/e234e759-ec66-48a0-8d42-3972f2e4dc90._CR0,0,500,500_SX460_.jpg",
        "review": "Never a issue with parts being damaged. I had a fitment issue with a part but managed to make it work with a bit glue to attach. The mold on the part was incorrect.",
        "rating": 4
    },
    {
        "name": "Kallie G",
        "img": "https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/741503e8-a4ed-4855-994a-3f5c783f52c7._CR69,0,362,362_SX460_.jpg",
        "review": "The part was delivered late. When I did a trial fit (you guessed it), wrong part, 24 hours before the paint appointment. How they could mess up something this SIMPLE is beyond me.",
        "rating": 5
    }
]